$(document).ready(function() {

    set = [{
            "name": "我",
            "爸爸": "爸爸",
            "妈妈": "妈妈",
            "哥哥": "哥哥",
            "姐姐": "姐姐",
            "丈夫": "丈夫",
            "妻子": "妻子",
            "弟弟": "弟弟",
            "妹妹": "妹妹",
            "儿子": "儿子",
            "女儿": "女儿"
        },

        {
            "name": "爷爷",
            "爸爸": "太公",
            "妈妈": "太婆",
            "哥哥": "伯公",
            "姐姐": "姑奶奶",
            "丈夫": "未知",
            "妻子": "奶奶",
            "弟弟": "叔伯",
            "妹妹": "姑奶奶",
            "儿子": {
                "长": "伯父",
                "轻": "叔叔",
                "中": "爸爸"
            },
            "女儿": "姑妈"
        },

        {
            "name": "奶奶",
            "爸爸": "外太公",
            "妈妈": "外太婆",
            "哥哥": "舅公",
            "姐姐": "姨婆",
            "丈夫": "爷爷",
            "妻子": "未知",
            "弟弟": "舅公",
            "妹妹": "姨婆",
            "儿子": {
                "长": "伯父",
                "轻": "叔叔",
                "中": "爸爸"
            },
            "女儿": "姑妈"
        },

        {
            "name": "外公",
            "爸爸": "外太公",
            "妈妈": "外太婆",
            "哥哥": "外伯公",
            "姐姐": "姑姥姥",
            "丈夫": "未知",
            "妻子": "外婆",
            "弟弟": "外伯公",
            "妹妹": "姑姥姥",
            "儿子": "舅舅",
            "女儿": "姨妈"
        },

        {
            "name": "外婆",
            "爸爸": "外太公",
            "妈妈": "外太婆",
            "哥哥": "外舅公",
            "姐姐": "姑姥姥",
            "丈夫": "外公",
            "妻子": "未知",
            "弟弟": "外舅公",
            "妹妹": "姑姥姥",
            "外姨婆": "舅舅",
            "女儿": "姨妈"
        },

        {
            "name": "姑妈",
            "爸爸": "爷爷",
            "妈妈": "奶奶",
            "哥哥": {
                "长": "伯父",
                "轻": "叔叔",
                "中": "爸爸"
            },
            "姐姐": "姑妈",
            "丈夫": "姑父",
            "妻子": "未知",
            "弟弟": {
                "长": "伯父",
                "轻": "叔叔",
                "中": "爸爸"
            },
            "妹妹": "姑妈",
            "儿子": {
                "长": "表哥",
                "轻": "表弟",
                "中": "你"
            },
            "女儿": {
                "长": "表姐",
                "轻": "表妹",
                "中": "你"
            }
        },

        {
            "name": "姑父",
            "爸爸": "姑爷爷",
            "妈妈": "姑奶奶",
            "哥哥": "姻世伯",
            "姐姐": "姻伯母",
            "丈夫": "未知",
            "妻子": "姑妈",
            "弟弟": "姻世伯",
            "妹妹": "姻伯母",
            "儿子": {
                "长": "表哥",
                "轻": "表弟",
                "中": "你"
            },
            "女儿": {
                "长": "表姐",
                "轻": "表妹",
                "中": "你"
            }
        },

        {
            "name": "叔叔",
            "爸爸": "爷爷",
            "妈妈": "奶奶",
            "哥哥": {
                "长": "伯父",
                "轻": "叔叔",
                "中": "爸爸"
            },
            "姐姐": "姑妈",
            "丈夫": "未知",
            "妻子": "婶婶",
            "弟弟": "叔叔",
            "妹妹": "姑妈",
            "儿子": {
                "长": "堂哥",
                "轻": "堂弟",
                "中": "你"
            },
            "女儿": {
                "长": "堂姐",
                "轻": "堂妹",
                "中": "你"
            }
        },

        {
            "name": "婶婶",
            "爸爸": "姻伯公",
            "妈妈": "姻伯婆",
            "哥哥": "姻世伯",
            "姐姐": "姻伯母",
            "丈夫": "叔叔",
            "妻子": "未知",
            "弟弟": "姻世伯",
            "妹妹": "姻伯母",
            "儿子": {
                "长": "堂哥",
                "轻": "堂弟",
                "中": "你"
            },
            "女儿": {
                "长": "堂姐",
                "轻": "堂妹",
                "中": "你"
            }
        },

        {
            "name": "伯父",
            "爸爸": "爷爷",
            "妈妈": "奶奶",
            "哥哥": "伯父",
            "姐姐": "姑妈",
            "丈夫": "未知",
            "妻子": "伯母",
            "弟弟": {
                "长": "伯父",
                "轻": "叔叔",
                "中": "爸爸"
            },
            "妹妹": "姑妈",
            "儿子": {
                "长": "堂哥",
                "轻": "堂弟",
                "中": "你"
            },
            "女儿": {
                "长": "堂姐",
                "轻": "堂妹",
                "中": "你"
            }
        },

        {
            "name": "伯母",
            "爸爸": "姻伯公",
            "妈妈": "姻伯婆",
            "哥哥": "姻世伯",
            "姐姐": "姻伯母",
            "丈夫": "伯父",
            "妻子": "未知",
            "弟弟": "姻世伯",
            "妹妹": "姻伯母",
            "儿子": {
                "长": "堂哥",
                "轻": "堂弟",
                "中": "你"
            },
            "女儿": {
                "长": "堂姐",
                "轻": "堂妹",
                "中": "你"
            }
        },

        {
            "name": "爸爸",
            "爸爸": "爷爷",
            "妈妈": "奶奶",
            "哥哥": "伯父",
            "姐姐": "姑妈",
            "丈夫": "未知",
            "妻子": "妈妈",
            "弟弟": "叔叔",
            "妹妹": "姨妈",
            "儿子": {
                "长": "哥哥",
                "轻": "弟弟",
                "中": "你"
            },
            "女儿": {
                "长": "姐姐",
                "轻": "妹妹",
                "中": "你"
            }
        },

        {
            "name": "妈妈",
            "爸爸": "外公",
            "妈妈": "外婆",
            "哥哥": "舅舅",
            "姐姐": "姨妈",
            "丈夫": "爸爸",
            "妻子": "未知",
            "弟弟": "舅舅",
            "妹妹": "姨妈",
            "儿子": {
                "长": "哥哥",
                "轻": "弟弟",
                "中": "你"
            },
            "女儿": {
                "长": "姐姐",
                "轻": "妹妹",
                "中": "你"
            }
        },

        {
            "name": "舅舅",
            "爸爸": "外公",
            "妈妈": "外婆",
            "哥哥": "舅舅",
            "姐姐": "姨妈",
            "丈夫": "未知",
            "妻子": "舅妈",
            "弟弟": "舅舅",
            "妹妹": "姨妈",
            "儿子": {
                "长": "表哥",
                "轻": "表弟",
                "中": "你"
            },
            "女儿": {
                "长": "表姐",
                "轻": "表妹",
                "中": "你"
            }
        },

        {
            "name": "舅妈",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "舅舅",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": {
                "长": "表哥",
                "轻": "表弟",
                "中": "你"
            },
            "女儿": {
                "长": "表姐",
                "轻": "表妹",
                "中": "你"
            }
        },

        {
            "name": "姨妈",
            "爸爸": "外公",
            "妈妈": "外婆",
            "哥哥": "舅舅",
            "姐姐": "姨妈",
            "丈夫": "姨夫",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": {
                "长": "表哥",
                "轻": "表弟",
                "中": "你"
            },
            "女儿": {
                "长": "表姐",
                "轻": "表妹",
                "中": "你"
            }
        },

        {
            "name": "姨夫",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "姨妈",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": {
                "长": "表哥",
                "轻": "表弟",
                "中": "你"
            },
            "女儿": {
                "长": "表姐",
                "轻": "表妹",
                "中": "你"
            }
        },

        {
            "name": "哥哥",
            "爸爸": "爸爸",
            "妈妈": "妈妈",
            "哥哥": "哥哥",
            "姐姐": "姐姐",
            "丈夫": "未知",
            "妻子": "嫂嫂",
            "弟弟": {
                "长": "哥哥",
                "轻": "弟弟",
                "中": "你"
            },
            "妹妹": {
                "长": "姐姐",
                "轻": "妹妹",
                "中": "你"
            },
            "儿子": "侄子",
            "女儿": "侄女"
        },

        {
            "name": "嫂嫂",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "哥哥",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "侄子",
            "女儿": "侄女"
        },

        {
            "name": "弟弟",
            "爸爸": "爸爸",
            "妈妈": "妈妈",
            "哥哥": {
                "长": "哥哥",
                "轻": "弟弟",
                "中": "你"
            },
            "姐姐": {
                "长": "姐姐",
                "轻": "妹妹",
                "中": "你"
            },
            "丈夫": "未知",
            "妻子": "弟媳",
            "弟弟": "弟弟",
            "妹妹": "妹妹",
            "儿子": "侄子",
            "女儿": "侄女"
        },

        {
            "name": "弟媳",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "弟弟",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "侄子",
            "女儿": "侄女"
        },

        {
            "name": "妹妹",
            "爸爸": "爸爸",
            "妈妈": "妈妈",
            "哥哥": "哥哥",
            "姐姐": "姐姐",
            "丈夫": "姐夫",
            "妻子": "未知",
            "弟弟": {
                "长": "哥哥",
                "轻": "弟弟",
                "中": "你"
            },
            "妹妹": {
                "长": "姐姐",
                "轻": "妹妹",
                "中": "你"
            },
            "儿子": "外甥",
            "女儿": "外甥女"
        },

        {
            "name": "姐夫",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "姐姐",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "外甥",
            "女儿": "外甥女"
        },

        {
            "name": "姐姐",
            "爸爸": "爸爸",
            "妈妈": "妈妈",
            "哥哥": {
                "长": "哥哥",
                "轻": "弟弟",
                "中": "你"
            },
            "姐姐": {
                "长": "姐姐",
                "轻": "妹妹",
                "中": "你"
            },
            "丈夫": "妹夫",
            "妻子": "未知",
            "弟弟": "弟弟",
            "妹妹": "妹妹",
            "儿子": "外甥",
            "女儿": "外甥女"
        },

        {
            "name": "妹夫",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "妹妹",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "外甥",
            "女儿": "外甥女"
        },

        {
            "name": "儿子",
            "爸爸": "我",
            "妈妈": "我",
            "哥哥": "哥哥",
            "姐姐": "姐姐",
            "丈夫": "未知",
            "妻子": "媳妇",
            "弟弟": "弟弟",
            "妹妹": "妹妹",
            "儿子": "孙子",
            "女儿": "孙女"
        },

        {
            "name": "媳妇",
            "爸爸": "亲家公",
            "妈妈": "亲家母",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "儿子",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "孙子",
            "女儿": "孙女"
        },

        {
            "name": "女儿",
            "爸爸": "我",
            "妈妈": "我",
            "哥哥": "哥哥",
            "姐姐": "姐姐",
            "丈夫": "女婿",
            "妻子": "未知",
            "弟弟": "弟弟",
            "妹妹": "妹妹",
            "儿子": "外孙",
            "女儿": "外孙女"
        },

        {
            "name": "女婿",
            "爸爸": "亲家公",
            "妈妈": "亲家母",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "女儿",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "外孙",
            "女儿": "外孙女"
        },

        {
            "name": "丈夫",
            "爸爸": "公公",
            "妈妈": "婆婆",
            "哥哥": "大伯子",
            "姐姐": "大姑子",
            "丈夫": "未知",
            "妻子": "我",
            "弟弟": "小叔子",
            "妹妹": "小姑子",
            "儿子": "儿子",
            "女儿": "女儿"
        },

        {
            "name": "妻子",
            "爸爸": "丈人",
            "妈妈": "丈母娘",
            "哥哥": "大舅子",
            "姐姐": "大姨子",
            "丈夫": "我",
            "妻子": "未知",
            "弟弟": "小舅子",
            "妹妹": "小姨子",
            "儿子": "儿子",
            "女儿": "女儿"
        },

        {
            "name": "大伯子",
            "爸爸": "公公",
            "妈妈": "婆婆",
            "哥哥": "大伯子",
            "姐姐": "大姑子",
            "丈夫": "未知",
            "妻子": "嫂嫂",
            "弟弟": {
                "长": "大伯子",
                "轻": "小叔子",
                "中": "丈夫"
            },
            "妹妹": {
                "长": "大姑子",
                "轻": "小姑子",
                "中": "丈夫"
            },
            "儿子": "侄子",
            "女儿": "侄女"
        },

        {
            "name": "小叔子",
            "爸爸": "公公",
            "妈妈": "婆婆",
            "哥哥": {
                "长": "大伯子",
                "轻": "小叔子",
                "中": "丈夫"
            },
            "姐姐": {
                "长": "大姑子",
                "轻": "小姑子",
                "中": "丈夫"
            },
            "丈夫": "未知",
            "妻子": "弟妹",
            "弟弟": "小叔子",
            "妹妹": "小姑子",
            "儿子": "侄子",
            "女儿": "侄女"
        },

        {
            "name": "大姑子",
            "爸爸": "公公",
            "妈妈": "婆婆",
            "哥哥": "大伯子",
            "姐姐": "大姑子",
            "丈夫": "姑丈",
            "妻子": "未知",
            "弟弟": {
                "长": "大伯子",
                "轻": "小叔子",
                "中": "丈夫"
            },
            "妹妹": {
                "长": "大姑子",
                "轻": "小姑子",
                "中": "丈夫"
            },
            "儿子": "侄子",
            "女儿": "侄女"
        },

        {
            "name": "小姑子",
            "爸爸": "公公",
            "妈妈": "婆婆",
            "哥哥": {
                "长": "大伯子",
                "轻": "小叔子",
                "中": "丈夫"
            },
            "姐姐": {
                "长": "大姑子",
                "轻": "小姑子",
                "中": "丈夫"
            },
            "丈夫": "姑丈",
            "妻子": "未知",
            "弟弟": "小叔",
            "妹妹": "小姑",
            "儿子": "侄子",
            "女儿": "侄女"
        },

        {
            "name": "大舅子",
            "爸爸": "丈人",
            "妈妈": "丈母娘",
            "哥哥": "大舅子",
            "姐姐": "大姨子",
            "丈夫": "未知",
            "妻子": "大妗子",
            "弟弟": {
                "长": "大舅子",
                "轻": "小舅子",
                "中": "妻子"
            },
            "妹妹": {
                "长": "大姨子",
                "轻": "小姨子",
                "中": "妻子"
            },
            "儿子": "外甥",
            "女儿": "外甥女"
        },

        {
            "name": "小舅子",
            "爸爸": "丈人",
            "妈妈": "丈母娘",
            "哥哥": {
                "长": "大舅子",
                "轻": "小舅子",
                "中": "妻子"
            },
            "姐姐": {
                "长": "大姨子",
                "轻": "小姨子",
                "中": "妻子"
            },
            "丈夫": "未知",
            "妻子": "小妗子",
            "弟弟": "小舅子",
            "妹妹": "小姨子",
            "儿子": "外甥",
            "女儿": "外甥女"
        },

        {
            "name": "大姨子",
            "爸爸": "丈人",
            "妈妈": "丈母娘",
            "哥哥": "大舅子",
            "姐姐": "大姨子",
            "丈夫": "姐夫",
            "妻子": "未知",
            "弟弟": {
                "长": "大舅子",
                "轻": "小舅子",
                "中": "妻子"
            },
            "妹妹": {
                "长": "大姨子",
                "轻": "小姨子",
                "中": "妻子"
            },
            "儿子": "外甥",
            "女儿": "外甥女"
        },

        {
            "name": "小姨子",
            "爸爸": "丈人",
            "妈妈": "丈母娘",
            "哥哥": {
                "长": "大舅子",
                "轻": "小舅子",
                "中": "妻子"
            },
            "姐姐": {
                "长": "大姨子",
                "妹妹": "小姨子",
                "中": "妻子"
            },
            "丈夫": "妹夫",
            "妻子": "未知",
            "弟弟": "小舅子",
            "妹妹": "小姨子",
            "儿子": "外甥",
            "女儿": "外甥女"
        },

        {
            "name": "未知",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "太公",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "太婆",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "外太公",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "外太婆",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "孙子",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "孙女",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "外孙",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "外孙女",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "弟妹",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "大妗子",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "小妗子",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "姑姥姥",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },

        {
            "name": "姑奶奶",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },
        {
            "name": "姻世伯",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },
        {
            "name": "姻伯母",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },
        {
            "name": "姻伯公",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        },
        {
            "name": "姑姥婆",
            "爸爸": "未知",
            "妈妈": "未知",
            "哥哥": "未知",
            "姐姐": "未知",
            "丈夫": "未知",
            "妻子": "未知",
            "弟弟": "未知",
            "妹妹": "未知",
            "儿子": "未知",
            "女儿": "未知"
        }
    ]

    sets = new Array();
    //查询谁的亲戚叫什么，如爸爸(whose)的爸爸(who)
    function Count(whose, who) {
        for (var p in set) {
            if (whose === set[p].name) {
                return set[p][who];
            }
        }
    }
    //判断是否年龄，此时长和轻的按钮会启用
    function IsEorY() {
        $("button").attr('disabled', true);
        $("#elder").attr('disabled', false);
        $("#younger").attr('disabled', false);
    }
    //判断后，长和轻的两个按钮会关闭
    function ChangeButton() {
        $("button").attr('disabled', false);
        $("#elder").attr('disabled', true);
        $("#younger").attr('disabled', true);
    }
    //点击按钮时，大显示屏会显示其属性
    $("button").click(function(event) {
        if ($(this).attr("val")) {
            $("#r").val($(this).attr("val"));
        }
    })
    //点击“的”按钮时动作
    $("#of").click(function(event) {
        var o = $("#c").val();
        $("#c").val(" " + o + " " + $("#r").val() + " 的");
        sets.unshift($("#r").val()); //将大显示屏数据插入到队列头部

        var result = Count(sets[1], sets[0]);
        //如果得到还是对象，则调用IsEorY方法判断年龄
        if (result) {
            if (typeof(result) == "object") {
                IsEorY();
                $("#r").val("比 " + result["中"] + " 年长/轻？");

                $("#elder").click(function(event) {
                    $("#r").val(result['长']);
                    ChangeButton();
                })

                $("#younger").click(function(event) {
                    $("#r").val(result['轻']);
                    ChangeButton();
                })
            } else { //如果不是则显示其数据
                $("#r").val(result);
                sets.unshift(result);
            }
        }
    })
    //"="按钮时动作
    $("#count").click(function() {
        var o = $("#c").val();
        $("#c").val(" " + o + " " + $("#r").val() + " ＝");
        sets.unshift($("#r").val());

        var result = Count(sets[1], sets[0]);

        if (result) {
            if (typeof(result) == "object") {
                IsEorY();
                $("#r").val("比 " + result["中"] + " 年长/轻？");

                $("#elder").click(function(event) {
                    $("#r").val(result['长']);
                    ChangeButton();
                })

                $("#younger").click(function(event) {
                    $("#r").val(result['轻']);
                    ChangeButton();
                })
            } else {
                $("#r").val(result);
                sets.unshift(result);
            }
        };
        //输出后，清空数组
        sets = [];
    })
    //重置键
    $("#clear").click(function() {
        sets = [];
        $("#r").val("我");
        $("#c").val(" ");
    })


})
